app/controllers/collage_controller.rb

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 17)
SELECT * FROM `collage_regions` WHERE (`collage_regions`.`collage_template_id` = 19)
---
  def configure
    @collage_template=CollageTemplate.find(params[:id])
    @collage_regions=CollageRegion.find(:all,:conditions => {:collage_template_id=> @collage_template.id})

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 19)
---
  def compile

    @info = JSON.parse(params[:params])
    @collage_template=CollageTemplate.find(params[:collage_template_id])

SELECT * FROM `images` WHERE (`images`.`id` = 2)
---
         if properties[:image_id]!=nil
         tmp_path = File.join(RAILS_ROOT, 'public/images/collage_temp/'+properties[:image_id]+"-"+Time.now.to_f.to_s+'.jpg')

        tmp = MiniMagick::Image.open(File.join(RAILS_ROOT, 'public/images/', Image.find(properties[:image_id]).file_name))

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def build

        image = Image.find(params[:id])