app/controllers/collage_templates_controller.rb

SELECT * FROM `collage_templates`
---
  def index
    @collage_templates = CollageTemplate.all

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 1)
SELECT * FROM `collage_regions` WHERE (`collage_regions`.`collage_template_id` = '1')
---
  def show
    @collage_template = CollageTemplate.find(params[:id])
    @collage_regions = CollageRegion.find_all_by_collage_template_id(params[:id])

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 1)
---
  def edit
    @collage_template = CollageTemplate.find(params[:id])

INSERT INTO `collage_templates` (`name`, `created_at`, `background`, `updated_at`) VALUES('Template Number 1', '2010-08-17 17:33:30', '', '2010-08-17 17:33:30')
---
  def create
    @collage_template = CollageTemplate.new(params[:collage_template])
   # post = CollageTemplate.save(params[:collage_template])

    respond_to do |format|
      if @collage_template.save

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 1)
UPDATE `collage_templates` SET `updated_at` = '2010-08-19 07:10:39', `name` = 'Dreaming', `background` = '128220183919133_collage_dreaming.jpg' WHERE `id` = 20
---
  def update
    @collage_template = CollageTemplate.find(params[:id])

    respond_to do |format|
      if @collage_template.update_attributes(params[:collage_template])

SELECT * FROM `collage_templates` WHERE (`collage_templates`.`id` = 17)
DELETE FROM `collage_templates` WHERE `id` = 17
---
  def destroy
    @collage_template = CollageTemplate.find(params[:id])
    @collage_template.destroy