app/controllers/collage_regions_controller.rb

SELECT * FROM `collage_regions`
---
  def index
    @collage_regions = CollageRegion.all

SELECT * FROM `collage_regions` WHERE (`collage_regions`.`id` = 1)
---
  def show
    @collage_region = CollageRegion.find(params[:id])

SELECT * FROM `collage_regions` WHERE (`collage_regions`.`id` = 2)
---
  def edit
    @collage_region = CollageRegion.find(params[:id])

INSERT INTO `collage_regions` (`name`, `left`, `created_at`, `collage_template_id`, `updated_at`, `height`, `top`, `width`) VALUES('we', 12, '2010-08-17 17:42:30', NULL, '2010-08-17 17:42:30', 12, 12, 12)
---
  def create

    logger.fatal("%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%")
    logger.fatal("Ajax post")
    logger.fatal("%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%")

    @collage_region = CollageRegion.new(params[:collage_region])


    respond_to do |format|
      if @collage_region.save

SELECT * FROM `collage_regions` WHERE (`collage_regions`.`id` = 29)
UPDATE `collage_regions` SET `updated_at` = '2010-08-18 20:23:39', `top` = 20, `height` = 300, `left` = 20, `width` = 200 WHERE `id` = 30
---
  def update
    @collage_region = CollageRegion.find(params[:id])

    respond_to do |format|
      if @collage_region.update_attributes(params[:collage_region])

SELECT * FROM `collage_regions` WHERE (`collage_regions`.`id` = 25)
DELETE FROM `collage_regions` WHERE `id` = 25
---
  def destroy
    @collage_region = CollageRegion.find(params[:id])
    @collage_region.destroy